Тест1/src/Catalogs/АвтоРаботы/АвтоРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АвтоРаботы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияЗапчастей</name>
    <type>
      <types>CatalogRef.Категории</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияРабот</name>
    <type>
      <types>CatalogRef.КатегорииРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НЕРассчёт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НормыВремени</name>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.МодельТС</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполнения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест1/src/Catalogs/АвтоРаботы/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновитьСтоимость();
	ОбновитьПредставлениеКатегории();
	
	ОбновитьВычисляемыеДанные();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДоступноИзменениеЦены = РольДоступна("дт_ИзменениеЦенНаРаботы") 
		ИЛИ Пользователи.ЭтоПолноправныйПользователь();
		
	
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьВычисляемыеДанные();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.НаименованиеПолное) Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КатегорияРаботПриИзменении(Элемент)
	
	ОбновитьСтоимость();
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяВыполненияПриИзменении(Элемент)
	ОбновитьСтоимость();
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьПриИзменении(Элемент)
	Если Нормочас <> 0 И Стоимость <> 0 Тогда
		Объект.ВремяВыполнения = Стоимость / Нормочас;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КатегорияЗапчастейПриИзменении(Элемент)
	ОбновитьПредставлениеКатегории();
КонецПроцедуры

&НаКлиенте
Процедура ВремяВыполненияСекПриИзменении(Элемент)
	Объект.ВремяВыполнения = дт_ОбщегоНазначенияКлиентСервер.ВремяВЧасы(ВремяВыполненияСек);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы



#КонецОбласти

#Область ОбработчикиКомандФормы



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСтоимость()

	Если ЗначениеЗаполнено(Объект.КатегорияРабот) Тогда
		Нормочас = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.КатегорияРабот, "Нормочас");
	Иначе
		Нормочас = 0;
	КонецЕсли;
	Элементы.Стоимость.Подсказка = ?(Нормочас = 0, "Определяется по нормочасу", "Нормочас " + Формат(Нормочас, "ЧДЦ=2; ЧГ=3,0"));
	Стоимость = Нормочас * Объект.ВремяВыполнения;

КонецПроцедуры // ОбновитьСтоимость()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ОбновитьПредставлениеКатегории()

	ПредставлениеКатегории = "";
	Если ЗначениеЗаполнено(Объект.КатегорияЗапчастей) Тогда
		ПредставлениеКатегории = дт_Автосервис.ПолучитьПредставлениеКатегории(Объект.КатегорияЗапчастей);
	КонецЕсли;

КонецПроцедуры // ОбновитьПредставлениеКатегории()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Элементы.Стоимость.Доступность = Форма.Нормочас <> 0;
	
	Элементы.ВремяВыполненияСек.Видимость = Ложь; // Форма.ПолучитьФункциональнуюОпциюФормы("дт_ИспользоватьЗаказНарядВнутренний");
	Элементы.ВремяВыполнения.Видимость = НЕ Элементы.ВремяВыполненияСек.Видимость;
	
	Элементы.Стоимость.ТолькоПросмотр = НЕ Форма.ДоступноИзменениеЦены;
	 
КонецПроцедуры // УправлениеФормой()


&НаСервере
Процедура ОбновитьВычисляемыеДанные()
	ВремяВыполненияСек = дт_ОбщегоНазначенияКлиентСервер.ЧасыВоВремя(Объект.ВремяВыполнения);
КонецПроцедуры





#КонецОбласти
